#+INCLUDE: /home/ttt/.templates/NoteConfig.org
#+TITLE: C++ Standard Libarary
#+DATE:  2018-12-13
#+OPTIONS: H:3 num:t toc:t ^:{}

本文重点是C++标准库，分为顺序容器、泛型算法、关联容器、动态内存四个大部分。
*** 赋值和swap
1. 赋值
   + 赋值运算符 :: 可以用在所有所有的容器类型中，必须保证赋值运算符左右两边的容器类型和容器的元素类型都一致
   + assign() :: 顺序容器（array 除外）还定义了一个 =assign= 的成员函数，允许我们从一个不同但相容的类型赋值，或者从一个容器的子序列赋值。
   赋值相关运算会导致原来指向左边容器内部的迭代器、引用和指针失效。
2. swap
   swap 操作交换两个相同类型容器的内容，除array外，该操作元素本身并未交换，只是交换了两个容器的内部数据结构，因此能在常数时间内完成，指向容器的迭代器、指针和引用仍指向交换操作之前所指向的元素，但是这些元素已经属于不同容器了；swap 两个array 会真正交换他们的元素，因此所需时间与其中元素的数量成正比，指向容器的迭代器、指针和引用保持不变，但其值已经发生了交换。统一使用非成员版本的swap 是一个好习惯。
#+BEGIN_SRC C++ -n -r :includes <iostream> :flags -Wall :main no :exports both :results value verbatim
  #include <array>
  #include <list>
  #include <string>
  #include <vector>
  int main(int argc, char *argv[]) {

      // assign
      std::vector<std::string> vs{{"English"}, {"Chinese"}};
      std::vector<char *> vs1{{"France"}, {"Japanese"}};
      std::list<char *> lc{{"England"}, {"China"}};
      // vs = vs1; //error
      vs.assign(lc.cbegin(), lc.cend());
      std::cout << vs.at(0) << '\t' << vs.at(1) << '\n';

      // swap
      std::vector<int> v1{1, 2, 3, 4, 5};
      std::vector<int> v2{6, 7, 8, 9};
      std::array<int, 5> a1{1, 2, 3, 4, 5};
      std::array<int, 5> a2{6, 7, 8, 9, 0};

      auto it1 = v1.cbegin();
      auto it2 = v2.cbegin();
      auto it3 = a1.cbegin();
      auto it4 = a2.cbegin();

      std::cout << "Before swap: " << *it1 << '\t' << *it2 << '\t' << *it3 << '\t'
              << *it4 << '\t' << &v1 << '\t' << &v2 << '\t' << &a1 << '\t' << &a2
              << '\n';
    std::swap(v1, v2);
    std::swap(a1, a2);
    std::cout << "After swap: " << *it1 << '\t' << *it2 << '\t' << *it3 << '\t'
              << *it4 << '\t' << &v1 << '\t' << &v2 << '\t' << &a1 << '\t' << &a2
              << '\n';

    it1 = v1.cbegin();
    it2 = v2.cbegin();
    it3 = a1.cbegin();
    it4 = a2.cbegin();
    std::cout << "After swap: " << *it1 << '\t' << *it2 << '\t' << *it3 << '\t'
              << *it4 << '\t' << &v1 << '\t' << &v2 << '\t' << &a1 << '\t' << &a2
              << '\n';
    return 0;
  }
#+END_SRC

#+RESULTS:
: England	China
: Before swap: 1	6	1	6	0x7ffe73a7c920	0x7ffe73a7c940	0x7ffe73a7c960	0x7ffe73a7c980
: After swap: 1	6	6	1	0x7ffe73a7c920	0x7ffe73a7c940	0x7ffe73a7c960	0x7ffe73a7c980
: After swap: 6	1	6	1	0x7ffe73a7c920	0x7ffe73a7c940	0x7ffe73a7c960	0x7ffe73a7c980
